openfoam/stepflow_forward/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 0.5 0)
    (2 0.5 0)
    (2 1 0)
    (1 1 0)
    (0 1 0)
    (0 0.5 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 0.5 0.1)
    (2 0.5 0.1)
    (2 1 0.1)
    (1 1 0.1)
    (0 1 0.1)
    (0 0.5 0.1)
);

blocks
(
    hex (0 1 2 7 8 9 10 15) (100 50 1) simpleGrading (0.2 0.2 1)
    hex (7 2 5 6 15 10 13 14) (100 50 1) simpleGrading (0.2 5 1)
    hex (2 3 4 5 10 11 12 13) (100 50 1) simpleGrading (5 5 1)
);

boundary
(
    INLET
    {
        type patch;
        faces
        (
            (0 7 15 8)
            (7 6 14 15)
        );
    }

    OUTLET
    {
        type patch;
        faces
        (
            (3 4 12 11)
        );
    }

    UP
    {
        type wall;
        faces
        (
            (6 5 13 14)
            (5 4 12 13)
        );
    }

    DOWN
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
        );
    }

    FRONT
    {
        type empty;
        faces
        (
            (0 1 2 7)
            (7 2 5 6)
            (2 3 4 5)
        );
    }
    
    BACK
    {
        type empty;
        faces
        (
            (8 9 10 15)
            (15 10 13 14)
            (10 11 12 13)
        );
    }
);


// ************************************************************************* //
